; domain
(define (domain miconic)
  (:requirements :strips)
  (:types passenger - object
          floor - object
         )

(:predicates 
(origin ?person - passenger ?floor - floor)
;; entry of ?person is ?floor
;; inertia

(destin ?person - passenger ?floor - floor)
;; exit of ?person is ?floor
;; inertia

(above ?floor1 - floor  ?floor2 - floor)
;; ?floor2 is located above of ?floor1

(boarded ?person - passenger)
;; true if ?person has boarded the lift

(not-boarded ?person - passenger)
;; true if ?person has not boarded the lift

(served ?person - passenger)
;; true if ?person has alighted as her destination

(not-served ?person - passenger)
;; true if ?person is not at their destination

(lift-at ?floor - floor)
;; current position of the lift is at ?floor
)


;;stop and allow boarding

(:action board
  :parameters (?f - floor ?p - passenger)
  :precondition (and (lift-at ?f) (origin ?p ?f))
  :effect (boarded ?p))

(:action depart
  :parameters (?f - floor ?p - passenger)
  :precondition (and (lift-at ?f) (destin ?p ?f)
		     (boarded ?p))
  :effect (and (not (boarded ?p))
	       (served ?p)))
;;drive up

(:action up
  :parameters (?f1 - floor ?f2 - floor)
  :precondition (and (lift-at ?f1) (above ?f1 ?f2))
  :effect (and (lift-at ?f2) (not (lift-at ?f1))))


;;drive down

(:action down
  :parameters (?f1 - floor ?f2 - floor)
  :precondition (and (lift-at ?f1) (above ?f2 ?f1))
  :effect (and (lift-at ?f2) (not (lift-at ?f1))))
)

; problem
(define (problem miconic-77)
 (:domain miconic)
 (:objects 
    p1 p2 p3 p4 p5 p6 p7 p8 - passenger
    f1 f2 f3 f4 f5 f6 f7 f8 f9 f10 f11 f12 f13 f14 f15 f16 - floor
    )
 (:init 
    (lift-at f1)
    (origin p1 f7)
    (destin p1 f13)
    (origin p2 f8)
    (destin p2 f7)
    (origin p3 f11)
    (destin p3 f1)
    (origin p4 f5)
    (destin p4 f14)
    (origin p5 f1)
    (destin p5 f16)
    (origin p6 f6)
    (destin p6 f2)
    (origin p7 f5)
    (destin p7 f2)
    (origin p8 f3)
    (destin p8 f12)
    (above f1 f2)
    (above f1 f3)
    (above f1 f4)
    (above f1 f5)
    (above f1 f6)
    (above f1 f7)
    (above f1 f8)
    (above f1 f9)
    (above f1 f10)
    (above f1 f11)
    (above f1 f12)
    (above f1 f13)
    (above f1 f14)
    (above f1 f15)
    (above f1 f16)
    (above f2 f3)
    (above f2 f4)
    (above f2 f5)
    (above f2 f6)
    (above f2 f7)
    (above f2 f8)
    (above f2 f9)
    (above f2 f10)
    (above f2 f11)
    (above f2 f12)
    (above f2 f13)
    (above f2 f14)
    (above f2 f15)
    (above f2 f16)
    (above f3 f4)
    (above f3 f5)
    (above f3 f6)
    (above f3 f7)
    (above f3 f8)
    (above f3 f9)
    (above f3 f10)
    (above f3 f11)
    (above f3 f12)
    (above f3 f13)
    (above f3 f14)
    (above f3 f15)
    (above f3 f16)
    (above f4 f5)
    (above f4 f6)
    (above f4 f7)
    (above f4 f8)
    (above f4 f9)
    (above f4 f10)
    (above f4 f11)
    (above f4 f12)
    (above f4 f13)
    (above f4 f14)
    (above f4 f15)
    (above f4 f16)
    (above f5 f6)
    (above f5 f7)
    (above f5 f8)
    (above f5 f9)
    (above f5 f10)
    (above f5 f11)
    (above f5 f12)
    (above f5 f13)
    (above f5 f14)
    (above f5 f15)
    (above f5 f16)
    (above f6 f7)
    (above f6 f8)
    (above f6 f9)
    (above f6 f10)
    (above f6 f11)
    (above f6 f12)
    (above f6 f13)
    (above f6 f14)
    (above f6 f15)
    (above f6 f16)
    (above f7 f8)
    (above f7 f9)
    (above f7 f10)
    (above f7 f11)
    (above f7 f12)
    (above f7 f13)
    (above f7 f14)
    (above f7 f15)
    (above f7 f16)
    (above f8 f9)
    (above f8 f10)
    (above f8 f11)
    (above f8 f12)
    (above f8 f13)
    (above f8 f14)
    (above f8 f15)
    (above f8 f16)
    (above f9 f10)
    (above f9 f11)
    (above f9 f12)
    (above f9 f13)
    (above f9 f14)
    (above f9 f15)
    (above f9 f16)
    (above f10 f11)
    (above f10 f12)
    (above f10 f13)
    (above f10 f14)
    (above f10 f15)
    (above f10 f16)
    (above f11 f12)
    (above f11 f13)
    (above f11 f14)
    (above f11 f15)
    (above f11 f16)
    (above f12 f13)
    (above f12 f14)
    (above f12 f15)
    (above f12 f16)
    (above f13 f14)
    (above f13 f15)
    (above f13 f16)
    (above f14 f15)
    (above f14 f16)
    (above f15 f16)
)
 (:goal (and 
(served p3)
(served p5)
(served p8)
))
)

; plan
1. (up f1 f11)
   deleted: (lift-at f1)
   added: (lift-at f11)
   goals met: 0 of 3
2. (board f11 p3)
   added: (boarded p3)
   goals met: 0 of 3
3. (down f11 f1)
   deleted: (lift-at f11)
   added: (lift-at f1)
   goals met: 0 of 3
4. (board f1 p5)
   added: (boarded p5)
   goals met: 0 of 3
5. (depart f1 p3)
   deleted: (boarded p3)
   added: (served p3)
   goals met: 1 of 3
6. (up f1 f16)
   deleted: (lift-at f1)
   added: (lift-at f16)
   goals met: 1 of 3
7. (depart f16 p5)
   deleted: (boarded p5)
   added: (served p5)
   goals met: 2 of 3
8. (down f16 f3)
   deleted: (lift-at f16)
   added: (lift-at f3)
   goals met: 2 of 3
9. (board f3 p8)
   added: (boarded p8)
   goals met: 2 of 3
10. (up f3 f12)
   deleted: (lift-at f3)
   added: (lift-at f12)
   goals met: 2 of 3
11. (depart f12 p8)
   deleted: (boarded p8)
   added: (served p8)
   goals met: 3 of 3
